Catalogs/бит_НастройкиОбменаССайтом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_НастройкиОбменаССайтом</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСайта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинСайт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольСайт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресFTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортFTP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогFTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинFTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольFTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТранспорта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаПоказаний</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПеня</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьОтдельнымиФайлами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокУлиц</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Улица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокЗданий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Здание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокЛС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_НастройкиОбменаССайтом/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПериодВыгрузкиПриИзменении(Элемент)
	
	Объект.ДатаНачалаПериода	= ПериодВыгрузки.ДатаНачала;
	Объект.ДатаОкончанияПериода = ПериодВыгрузки.ДатаОкончания;
	
КонецПроцедуры

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.ДатаНачалаПериода) Тогда
		ПериодВыгрузки.ДатаНачала = Объект.ДатаНачалаПериода;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДатаОкончанияПериода) Тогда
		ПериодВыгрузки.ДатаОкончания = Объект.ДатаОкончанияПериода;	
	КонецЕсли;
	
    Объект.ВыгружатьОтдельнымиФайлами = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогОткрытияФайла.Заголовок= НСтр("ru = 'Выберите каталог для сохранения файлов выгрузки'");
	ДиалогОткрытияФайла.Каталог = Элементы.КаталогВыгрузки.ТекстРедактирования;
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Объект.КаталогВыгрузки = ДиалогОткрытияФайла.Каталог;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РазоваяВыгрузкаЗданий(Команда)
	
	Если Модифицированность Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо записать настройку перед формирвоанием выгрузки!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	РазоваяВыгрузкаЗданийНаСервере(Объект.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура РазоваяВыгрузкаЗданийНаСервере(Ссылка)
	
	ПараметрыОбмена = бит_ОбменССайтом.ПолучитьПараметрыОбмена(Ссылка);
	бит_ОбменССайтом.ВыгрузитьЗдания(ПараметрыОбмена);
	
КонецПроцедуры

&НаКлиенте
Процедура РазоваяВыгрузкаКвартир(Команда)
	
	Если Модифицированность Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо записать настройку перед формирвоанием выгрузки!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	РазоваяВыгрузкаКвартирНаСервере(Объект.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура РазоваяВыгрузкаКвартирНаСервере(Ссылка)
	
	ПараметрыОбмена = бит_ОбменССайтом.ПолучитьПараметрыОбмена(Ссылка);
	бит_ОбменССайтом.ВыгрузитьКвартиры(ПараметрыОбмена);
	
КонецПроцедуры

&НаКлиенте
Процедура РазоваяВыгрузкаЛС(Команда)
	
	Если Модифицированность Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо записать настройку перед формирвоанием выгрузки!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	РазоваяВыгрузкаЛСНаСервере(Объект.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура РазоваяВыгрузкаЛСНаСервере(Ссылка)
	
	ПараметрыОбмена = бит_ОбменССайтом.ПолучитьПараметрыОбмена(Ссылка);
	бит_ОбменССайтом.ВыгрузитьЛицевыеСчета(ПараметрыОбмена);
	
КонецПроцедуры

&НаКлиенте
Процедура РазоваяВыгрузкаУслуг(Команда)
	
	Если Модифицированность Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо записать настройку перед формирвоанием выгрузки!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	РазоваяВыгрузкаУслугНаСервере(Объект.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура РазоваяВыгрузкаУслугНаСервере(Ссылка)
	
	ПараметрыОбмена = бит_ОбменССайтом.ПолучитьПараметрыОбмена(Ссылка);
	бит_ОбменССайтом.ВыгрузитьУслуги(ПараметрыОбмена);
	
КонецПроцедуры

&НаКлиенте
Процедура РазоваяВыгрузкаУслугПОЛС(Команда)
	
	Если Модифицированность Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо записать настройку перед формирвоанием выгрузки!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	РазоваяВыгрузкаУслугПОЛСНаСервере(Объект.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура РазоваяВыгрузкаУслугПОЛСНаСервере(Ссылка)
	
	ПараметрыОбмена = бит_ОбменССайтом.ПолучитьПараметрыОбмена(Ссылка);
	бит_ОбменССайтом.ВыгрузитьУслугиПОЛС(ПараметрыОбмена);
	
КонецПроцедуры

&НаКлиенте
Процедура РазоваяВыгрузкаСчетчиков(Команда)
	
	Если Модифицированность Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо записать настройку перед формирвоанием выгрузки!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	РазоваяВыгрузкаСчетчиковНаСервере(Объект.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура РазоваяВыгрузкаСчетчиковНаСервере(Ссылка)
	
	ПараметрыОбмена = бит_ОбменССайтом.ПолучитьПараметрыОбмена(Ссылка);
	бит_ОбменССайтом.ВыгрузитьСчетчики(ПараметрыОбмена);
	
КонецПроцедуры

&НаКлиенте
Процедура РазоваяВыгрузкаОперацийПоЛС(Команда)
	
	Если Модифицированность Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо записать настройку перед формирвоанием выгрузки!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	РазоваяВыгрузкаОперацийПоЛСНаСервере(Объект.Ссылка);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура РазоваяВыгрузкаОперацийПоЛСНаСервере(Ссылка)
	
	ПараметрыОбмена = бит_ОбменССайтом.ПолучитьПараметрыОбмена(Ссылка);
	бит_ОбменССайтом.ВыгрузитьОперацииПоЛС(ПараметрыОбмена);
	
КонецПроцедуры

&НаКлиенте
Процедура РазоваяВыгрузкаЕПД(Команда)
	
	Если Модифицированность Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо записать настройку перед формирвоанием выгрузки!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	РазоваяВыгрузкаЕПДНаСервере(Объект.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура РазоваяВыгрузкаЕПДНаСервере(Ссылка)
	
	ПараметрыОбмена = бит_ОбменССайтом.ПолучитьПараметрыОбмена(Ссылка);
	//23.05.2019
	бит_ОбменССайтом.ВыгрузитьЕПД(ПараметрыОбмена, Ссылка.УчитыватьПеня);
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	
	Если Модифицированность Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо записать настройку перед формирвоанием выгрузки!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ВыгрузитьНаСервере(Объект.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыгрузитьНаСервере(Ссылка)
	
	ПараметрыОбмена = бит_ОбменССайтом.ПолучитьПараметрыОбмена(Ссылка);
	бит_ОбменССайтом.Выгрузить(ПараметрыОбмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПоказанияСчетчиков(Команда)
	
	Если Модифицированность Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо записать настройку перед загрузкой данных!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ЗагрузитьПоказанияСчетчиковНаСервере(Объект.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьПоказанияСчетчиковНаСервере(Ссылка)
	
	ПараметрыОбмена = бит_ОбменССайтом.ПолучитьПараметрыОбмена(Ссылка);
	бит_ОбменССайтом.ЗагрузитьПоказанияСчетчиков(ПараметрыОбмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборЗданий(Команда)
	
	ПарамОтбора = Новый Структура("ПометкаУдаления", Ложь);
	ПараметрыОткрытия = Новый Структура("РежимВыбора, МножественныйВыбор, ЗакрыватьПриВыборе, Отбор", Истина, Истина, Ложь, ПарамОтбора);
	ОткрытьФорму("Справочник.бит_СписокЗданий.ФормаВыбора", ПараметрыОткрытия, Элементы.СписокЗданий, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборЛС(Команда)
	
	ПарамОтбора = Новый Структура("ПометкаУдаления", Ложь);
	ПараметрыОткрытия = Новый Структура("РежимВыбора, МножественныйВыбор, ЗакрыватьПриВыборе, Отбор", Истина, Истина, Ложь, ПарамОтбора);
	ОткрытьФорму("Справочник.бит_ЛицевыеСчета.ФормаВыбора", ПараметрыОткрытия, Элементы.СписокЛС, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборУлиц(Команда)
	
	ПарамОтбора = Новый Структура("ПометкаУдаления", Ложь);
	ПараметрыОткрытия = Новый Структура("РежимВыбора, МножественныйВыбор, ЗакрыватьПриВыборе, Отбор", Истина, Истина, Ложь, ПарамОтбора);
	ОткрытьФорму("Справочник.бит_СписокУлиц.ФормаВыбора", ПараметрыОткрытия, Элементы.СписокУлиц, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборУслуг(Команда)
	
	ПарамОтбора = Новый Структура("ПометкаУдаления", Ложь);
	ПараметрыОткрытия = Новый Структура("РежимВыбора, МножественныйВыбор, ЗакрыватьПриВыборе, Отбор", Истина, Истина, Ложь, ПарамОтбора);
	ОткрытьФорму("Справочник.бит_УслугиЖКХ.ФормаВыбора", ПараметрыОткрытия, Элементы.СписокУслуг, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаFTP(Команда)
	
		
	НастройкиТранспорта = ПолучитьFTPНастройкиСоединения();
	ЗаполнитьЗначенияСвойств(НастройкиТранспорта, Объект);
	
	РезультатПроверки = ПроверкаFTPСервер(НастройкиТранспорта);
	Если РезультатПроверки.Результат = Ложь Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = '%1'"), РезультатПроверки.Причина);
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Проверка пройдена успешно.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьFTPНастройкиСоединения() Экспорт
	
	FTPНастройкиСоединения = Новый Структура();
	FTPНастройкиСоединения.Вставить("АдресFTP",				"");
	FTPНастройкиСоединения.Вставить("КаталогFTP",			"");
	FTPНастройкиСоединения.Вставить("ПортFTP",				21);
	FTPНастройкиСоединения.Вставить("ЛогинFTP",				"");
	FTPНастройкиСоединения.Вставить("ПарольFTP",			"");
	FTPНастройкиСоединения.Вставить("ПассивноеСоединение",	Истина);
	FTPНастройкиСоединения.Вставить("ЗащищенноеСоединение",	Неопределено);
	
	Возврат FTPНастройкиСоединения;

КонецФункции

&НаСервереБезКонтекста
Функция ПроверкаFTPСервер(НастройкиТранспорта)
	
	РезультатПроверки = Новый Структура("Результат, Причина", Истина, "");
	
	НастройкиFTP = ОбменДаннымиСервер.FTPНастройкиСоединения(10);
	НастройкиFTP.Сервер               = НастройкиТранспорта.АдресFTP;
	НастройкиFTP.Порт                 = НастройкиТранспорта.ПортFTP;
	НастройкиFTP.ИмяПользователя      = НастройкиТранспорта.ЛогинFTP;
	НастройкиFTP.ПарольПользователя   = НастройкиТранспорта.ПарольFTP;
	Если НастройкиТранспорта.ЗащищенноеСоединение Тогда
		НастройкиFTP.ЗащищенноеСоединение= Новый ЗащищенноеСоединениеOpenSSL;
	Иначе
		НастройкиFTP.ЗащищенноеСоединение = Неопределено;
	КонецЕсли;
	
	Попытка
		
		FTPСоединение = ОбменДаннымиСервер.FTPСоединение(НастройкиFTP);
		
		Если СтрДлина(НастройкиТранспорта.КаталогFTP) > 1 Тогда
			ИмяКаталога = ПолучитьИмяКаталога(НастройкиТранспорта.КаталогFTP);
			Если НЕ ОбменДаннымиСервер.FTPКаталогСуществует(НастройкиТранспорта.КаталогFTP, ИмяКаталога, FTPСоединение) Тогда
				РезультатПроверки.Результат = Ложь;
				РезультатПроверки.Причина	= НСтр("ru = 'Соединение с свервером установлено, но каталог не найден!'");
			КонецЕсли;
		КонецЕсли;
		
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		РезультатПроверки.Результат = Ложь;
		РезультатПроверки.Причина	= КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецПопытки;
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаКлиенте
Процедура ПроверкаСайт(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ДатаНачалаПериода	= РезультатВыбора.НачалоПериода;
	Объект.ДатаОкончанияПериода = РезультатВыбора.КонецПериода;
	//
	//ЗаполнитьЗначенияСвойств(Объект, РезультатВыбора, "НачалоПериода, КонецПериода");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция FTPСоединение(Знач Настройки)
	
	Возврат Новый FTPСоединение(
		Настройки.Сервер,
		Настройки.Порт,
		Настройки.ИмяПользователя,
		Настройки.ПарольПользователя,
		Неопределено,
		Настройки.ПассивноеСоединение,
		Настройки.Таймаут,
		Настройки.ЗащищенноеСоединение);
	
КонецФункции

&НаСервереБезКонтекста
Функция FTPНастройкиСоединения(Знач Таймаут = 180)
	
	Результат = Новый Структура;
	Результат.Вставить("Сервер", "");
	Результат.Вставить("Порт", 21);
	Результат.Вставить("ИмяПользователя", "");
	Результат.Вставить("ПарольПользователя", "");
	Результат.Вставить("ПассивноеСоединение", Ложь);
	Результат.Вставить("Таймаут", Таймаут);
	Результат.Вставить("ЗащищенноеСоединение", Неопределено);
	
	Возврат Результат;
КонецФункции

&НаСервере
// Подготовка пути FTP.
//
// Параметры:
//  Путь - Строка - путь для FTP сервера.
//
Процедура ПодготовитьПутьFTP(Путь) Экспорт
	
	Путь = СтрЗаменить(Путь, "\", "/");
	Если ЗначениеЗаполнено(Путь) Тогда
		Если НЕ Лев(Путь, 1) = "/" Тогда
			Путь = "/" + Путь;
		КонецЕсли;
		Если НЕ Прав(Путь, 1) = "/" Тогда
			Путь = Путь + "/";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмяКаталога(Знач Путь)
	
	МассивИмен = СтрРазделить(Путь, "/", Ложь);
	Возврат МассивИмен[МассивИмен.ВГраница()];
	
КонецФункции

#КонецОбласти
